Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/unemployment_and_redundancy/employment_support_schemes/revenue_job_assist.html.txt.tmx
Source language: en
Languages: ga

source: • Rates • How to apply
ga: • Conas iarratas a dhéanamh

source: Revenue Job Assist is an additional tax allowance for people who have been unemployed for 12 months or more and who are now returning to employment
ga: Is liúntas breise cánach é Postchúnamh Ioncaim, agus atá do dhaoine a bhí dífhostaithe ar feadh 12 mhí nó níos mó agus atá ag filleadh ar fhostaíocht anois

source: An extra tax allowance can be claimed for each qualifying child (see below)
ga: Is féidir liúntas breise cánach a éileamh as gach leanbh atá incháilithe (féach thíos)

source: The tax allowance can be claimed for 3 tax years and may begin with either the tax year in which the employment commences or the following tax year
ga: Is féidir an liúntas cánach a éileamh go ceann 3 bliana cánach agus is féidir leis tosú leis an mbliain chánach ina dtosaíonn an fhostaíocht nó an bhliain chánach ina dhiaidh sin

source: The scheme is an alternative to existing employment schemes and you cannot claim these tax allowances if you are participating in another employment scheme
ga: Is malairt í an scéim ar scéimeanna fostaíochta atá ann anois agus ní féidir úsáid as na liúntais seo a bhaint má ghlacann tú páirt i scéim fostaíochta eile

source: Revenue Job Assist ceased on 30 June 2013 for new participants
ga: An 30 Meitheamh 2013 cuireadh deireadh le Postchúnamh Ioncaim

source: Since I July 2013 a new JobsPlus incentive scheme has replaced Revenue Job Assist and the Employer Job (PRSI) Exemption Scheme
ga: Ó 1 Iúil 2013 cuireadh scéim dreasachta nua JobsPlus in áit na Postchúnamh Ioncaim agus Scéime Dreasachta Jabanna (ÁSPC) i gcomhair Fostóirí

source: Existing participants on Revenue Job Assist will not be affected by the new JobsPlus scheme
ga: Ní bhainfidh an scéim nua JobsPlus le rannpháirtithe reatha ar Postchúnamh Ioncaim

source: You may qualify for Revenue Job Assist (RJA) if you are unemployed for 12 months or more* and you are:
ga: D’fhéadfá a bheith incháilithe d’ Postchúnamh Ioncaim, má tá tú dífhostaithe ar feadh 12 mhí ar a laghad* agus má:

source: • Getting Jobseeker's Benefit, Jobseeker's Allowance, One-Parent Family Payment, Disability Allowance, Blind Person's Pension or Invalidity Pension for 12 months or more
ga: • Tá tú ag fáil Sochar Cuardaitheora Poist, Liúntas Cuardaitheora Poist, Íocaíocht Teaghlaigh AonTuismitheora, Liúntas Míchumais, Pinsean na nDall nó Pinsean Easláinte ar feadh tréimhse 12 mí nó níos mó

source: • Getting Illness Benefit for 18 months or more
ga: • Tá tú ag fáil Sochar Breoiteachta ar feadh tréimhse 18 mhí nó níos mó

source: • Released after 12 months or more in prison (time spent in prison is considered equivalent to periods of unemployment)
ga: • Scaoiltear thú saor tar éis 12 mí nó níos faide i bpríosún

source: • Signing for PRSI credits
ga: • Tá tú ag síniú i gcomhair creidmheasanna ÁSPC

source: *Time spent on Community Employment, Job Initiative, Tús, JobBridge, Rural Social Scheme, certain FÁS courses or the Back to Education Allowance (BTEA), provided you were getting one of the qualifying payments listed above immediately before starting BTEA, may count towards the period of unemployment required
ga: *D’fhéadfadh go gcuirfí am a chaitear ar Fhostaíocht Pobail, Tionscnamh Poist, Tús, JobBridge, Scéim Soisíalta Tuaithe, cúrsaí FÁS áirithe, nó ar an Liúntas um Fhilleadh ar Oideachas (LFO), ar choinníoll go bhfaigheann tú ceann do na híocaíochtaí seo thuas díreach roimh thús LFO, san áireamh i dtreo na tréimhse dífhostaíochta riachtanach

source: The job you are taking up must:
ga: Caithfidh an post atá tú ag tógáil:

source: • Be for a minimum of 30 hours a week
ga: • Caithfidh tú a bheith ag obair ar a laghad 30 uair a chloig sa tseachtain

source: • Be capable of lasting at least 12 months
ga: • Caithfidh an post a bheith ar feadh tréimhse 12 mí ar a laghad

source: You can find more details in the explanatory leaflet, Revenue Job Assist IT58 - information for employees
ga: Tá níos mó sonraí sa bhileog eolais, Postchúnamh Ioncaim IT58 – faisnéis d’fostaithe

source: Revenue Job Assist only applies if you are taking up a job and does not apply if you are becoming self-employed
ga: Ní féidir leat leas a bhaint as Postchúnamh Ioncaim ach amháin sa chás go bhfuil post dhá thógáil agat ní bhaineann sé leis an bhféinfhostaíocht

source: It can only be set against income from the new job that you have taken up
ga: Baineann an liúntas cánach amháin leis an ioncam ón bpost nua a thógann duine

source: You can change jobs once and retain the balance of the credit
ga: Is féidir le fostaí an post a athrú uair amháin agus fuíollach an liúntais a choinneáil

source: The tax allowance can be claimed irrespective of your civil status
ga: Is féidir éileamh a dhéanamh ar an liúntas, is cuma cén stádas sibhialta atá agat

source: A qualifying child is a child of yours, who is living with you for all or part of the tax year, and who is:
ga: Is é is leanbh incháilithe ann ná leanbh de do chuid, atá ina chónaí leat ar feadh iomlán nó páirt den bhliain chánach, agus atá:

source: • Under 18 years of age or
ga: • Faoi 18 bliana d’aois nó

source: • Over 18 years and in full-time education or training as an apprentice where the training is for at least 2 years or
ga: • Níos sine ná 18 bliana agus in oideachas lánaimseartha nó in oiliúint mar phrintíseach nuair atá an oiliúint ann ar feadh 2 bhliain ar a laghad nó

source: • Incapacitated either physically or mentally, having become so either while undergoing full-time education or while under 21 years of age
ga: • Éagumasaithe go fisiceach nó go meabhrach, tar éis gur éirigh siad amhlaidh le linn dóibh a bheith in oideachas lánaimseartha nó nuair a bhí siad 21 bliain d’aois

source: Two people can claim for the same child but only one allowance can be claimed for each qualifying child in any year
ga: Is féidir le beirt dhaoine éileamh a dhéanamh ar son an linbh chéanna ach ní féidir ach aon liúntas a éileamh do gach leanbh incháilithe in aon bhliain amháin

source: If 2 people are entitled to claim for the same child, the allowance is split between them as follows:
ga: Má tá beirt i dteideal éileamh a dhéanamh don leanbh céanna, roinntear an liúntas eatartha mar a leanas:

source: • Where the child is maintained by 1 person only, that person gets the allowance
ga: • Má tá an leanbh á chothabháil ag duine amháin, faigheann an duine sin an liúntas

source: • Where the child is maintained jointly by 1 or more people, the credit is split either in the same proportion as they each maintain the child or in a manner they jointly decide on
ga: • Má tá an leanbh a chothabháil i gcomhar lena chéile ag 1 nó níos mó daoine, roinntear an creidmheas sa coimhréir chéanna ina gcothabhálann siad an leanbh nó ar an dóigh a socraíonn siadsan i gcomhar lena chéile

source: In addition to the special tax allowance, under Revenue Job Assist, you can keep your medical card for 3 years from the date of return to work
ga: Le cois an liúntais speisialta cánach, faoin bPostchúnamh Ioncaim, is féidir leat do chárta míochaine a choinneáil go ceann 3 bliana ón dáta a bhfilleann tú ar do chuid oibre

source: You can also retain other secondary benefits, such as Fuel Allowance, for 3 years, provided your weekly income is less than €317.43
ga: Is féidir leat sochair thánaisteacha eile a choinneáil, amhail Liúntas Breosla, go ceann 3 bliana, ar an gcoinníoll go bhfuil d’ioncam seachtainiúil faoi €317.43

source: However the amount of Rent Supplement or Mortgage Interest Supplement you get may be reduced
ga: B’fhéidir, áfach, go ndéanfaí laghdú ar mhéid an Forlíonadh Cíosa nó Forlíonadh Ús Morgáiste a fhaigheann tú

source: Employers who employ people who qualify for Revenue Job Assist can make a double deduction of the employee's wages from their company's taxable income for up to 3 years provided that the employee remains with them
ga: Is féidir le fostóirí a fhostaíonn daoine atá incháilithe do Phostchúnamh Ioncaim asbhaint dhúbáilte a dhéanamh d’ioncam an fhostaí ó ioncam incháinaithe a gcuideachta do suas le 3 bliana ar an gcoinníoll go bhfanann an fostaí leo

source: This means that double the amount of the wages of a qualifying employee and double the amount of the employer’s PRSI contribution for that employee can be deducted by the employer from the company’s taxable income
ga: Ciallaíonn sé gurbh fhéidir leis fostóir an méid dúbailte phá fhostaí incháilithe agus an méid dúbailte ranníocaíochta ÁSPC fhostóra a asbhaint ón ioncam inchánaithe na cuideachta

source: An employee who started work in January 2011 is paid €350 a week, (€18,200 a year) and qualifies for Revenue Job Assist
ga: Thosaigh fostaí ag obair in Eanáir 2009, íoctar leis €350 sa tseachtain, (€18,200 sa bhliain) agus tá sé incháilithe i gcomhair Postchúnamh Ioncaim

source: If that employee continues to work for the employer until the end of 2013, the employer can reduce his taxable income by double the amount of the employee’s wages and double the amount of employer’s PRSI as follows:
ga: Má leanann an fostaí oibrigh don fhostóir suas go dtí críoch 2011, féadfaidh an fostóir a ioncam inchánaithe a laghdú leis an méid dúbailte phá fhostaí agus leis an méid dúbailte ranníocaíochta ÁSPC fhostóra mar a leanas:

source: │Employee’s annual wages = €18,200 x 2 │€36,400│
ga: │Pá bliantúil an fhostaí = €18,200 x 2 │€36,400 │

source: │Employer’s annual PRSI 2011 = €1,547 x 2 │€3,094 │
ga: │ÁSPC bliantúil an fhostóra 2011 = €1,547 x 2 │€3,094 │

source: │Total annual tax deduction 2011 │€39,494│
ga: │Iomlán asbhaint chánach 2011 │€39,494 │

source: So in 2011 under Revenue Job Assist the company’s taxable income may be reduced by €39,494
ga: Dá bhrí sin, i 2011 faoi Postchúnamh Ioncaim d’fhéadfadh ioncam inchánaithe na cuideachta a bheith laghdaithe le €39,494

source: In 2012 and 2013 it may be reduced by €37,947 each year
ga: I 2012 agus 2013 d’fhéadfadh ioncam inchánaithe na cuideachta a bheith laghdaithe le €37,947 gach bliain

source: This would come to a total tax deduction of €115,388
ga: Beidh an t-iomlán asbhaint chánach €115,388

source: Employer's PRSI exemption: If you take on extra employees under the Revenue Job Assist scheme in 2012, you may qualify for the Employer Job (PRSI) Incentive Scheme for up to 18 months
ga: Díolúine ó ÁSPC i gcomhair fostóirí: Má chruthaíonn tú jabanna nua i 2012 faoin scéim Postchúnamh Ioncaim, d'fhéadfá a bheith cáilithe don Scéim Dreasachta Jabanna (ÁSPC) i gcomhair Fostóirí ar feadh 18 mhí

source: The Revenue Job Assist allowances are at your highest rate of tax and appear as an increase to your tax credits as follows:
ga: Tá na liúntais Phostchúnaimh Ioncaim ag do ráta cánach is airde agus léirítear iad mar mhéadú ar do chreidmheasanna cánach mar a leanas:

source: Year One: extra allowance of €3,810 and €1,270 for each qualifying child
ga: │Bliain a │liúntas breise de €3,810 agus €1,270 do gach leanbh incháilithe │

source: Year Two reducing to two-thirds of this amount, that is, €2,540 and €850 for each child
ga: │Bliain a Dó │ag laghdú chuig dhá thrian den mhéid seo, is é sin, €2,540 agus €850 do gach │

source: Year Three one-third of amount allowed in year one, that is, €1,270 and €425 for each child
ga: │Bliain a Trí │aon tríú den mhéid ceadaithe i mbliain a haon, is é sin, €1,270 agus €425 do gach│

source: You apply by completing Part 1 of form RJA (pdf)
ga: Déan iarratas tríd Cuid 1 d’fhoirm RJA (pdf) a líonadh

source: This form is also available from your local tax office
ga: Tá an fhoirm seo ar fáil ón oifig áitiúil chánach

source: Part 2 of the form must completed by your employer and the completed form should be sent to your local tax office
ga: Caithfidh d’fhostóir Cuid 2 d’fhoirm a chomhlánú agus ba chóir an fhoirm chomhlánaithe chuig d’oifig chánach áitiúil a sheoladh

source: Contact your local tax office
ga: Cá háit a ndéanfaidh mé iarratas?
